mongo-play/ycsb/local/bLoad
mongo client connection created with mongodb://10.0.4.15:27017
[OVERALL], RunTime(ms), 8360
[OVERALL], Throughput(ops/sec), 598.0861244019138
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 31
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.3708133971291866
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 31
[TOTAL_GC_TIME_%], Time(%), 0.3708133971291866
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3699.0
[CLEANUP], MinLatency(us), 3698
[CLEANUP], MaxLatency(us), 3699
[CLEANUP], 95thPercentileLatency(us), 3699
[CLEANUP], 99thPercentileLatency(us), 3699
[INSERT], Operations, 5000
[INSERT], AverageLatency(us), 560.5732
[INSERT], MinLatency(us), 306
[INSERT], MaxLatency(us), 418303
[INSERT], 95thPercentileLatency(us), 818
[INSERT], 99thPercentileLatency(us), 1148
[INSERT], Return=OK, 5000