mongo-play/ycsb/local/bRun
mongo client connection created with mongodb://10.0.4.15:27017
[OVERALL], RunTime(ms), 8021
[OVERALL], Throughput(ops/sec), 623.3636703652911
[TOTAL_GCS_G1_Young_Generation], Count, 3
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 32
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.3989527490337863
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 32
[TOTAL_GC_TIME_%], Time(%), 0.3989527490337863
[READ], Operations, 4742
[READ], AverageLatency(us), 479.00822437789964
[READ], MinLatency(us), 310
[READ], MaxLatency(us), 70271
[READ], 95thPercentileLatency(us), 884
[READ], 99thPercentileLatency(us), 1288
[READ], Return=OK, 4742
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3001.0
[CLEANUP], MinLatency(us), 3000
[CLEANUP], MaxLatency(us), 3001
[CLEANUP], 95thPercentileLatency(us), 3001
[CLEANUP], 99thPercentileLatency(us), 3001
[UPDATE], Operations, 258
[UPDATE], AverageLatency(us), 679.9922480620155
[UPDATE], MinLatency(us), 449
[UPDATE], MaxLatency(us), 12711
[UPDATE], 95thPercentileLatency(us), 968
[UPDATE], 99thPercentileLatency(us), 1259
[UPDATE], Return=OK, 258