mongo-play/ycsb/local/cLoad
mongo client connection created with mongodb://10.0.4.15:27017
[OVERALL], RunTime(ms), 8147
[OVERALL], Throughput(ops/sec), 613.7228427642077
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 28
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.3436847919479563
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 28
[TOTAL_GC_TIME_%], Time(%), 0.3436847919479563
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3345.0
[CLEANUP], MinLatency(us), 3344
[CLEANUP], MaxLatency(us), 3345
[CLEANUP], 95thPercentileLatency(us), 3345
[CLEANUP], 99thPercentileLatency(us), 3345
[INSERT], Operations, 5000
[INSERT], AverageLatency(us), 517.441
[INSERT], MinLatency(us), 314
[INSERT], MaxLatency(us), 294399
[INSERT], 95thPercentileLatency(us), 787
[INSERT], 99thPercentileLatency(us), 1122
[INSERT], Return=OK, 5000